GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.inc
// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0798h
// bitfield definitions
PMD2_ZCDMD_POSN                          equ 0000h
PMD2_ZCDMD_POSITION                      equ 0000h
PMD2_ZCDMD_SIZE                          equ 0001h
PMD2_ZCDMD_LENGTH                        equ 0001h
PMD2_ZCDMD_MASK                          equ 0001h
PMD2_CMP1MD_POSN                         equ 0001h
PMD2_CMP1MD_POSITION                     equ 0001h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0002h
PMD2_CMP2MD_POSN                         equ 0002h
PMD2_CMP2MD_POSITION                     equ 0002h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0004h
PMD2_ADCMD_POSN                          equ 0005h
PMD2_ADCMD_POSITION                      equ 0005h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0020h
PMD2_DACMD_POSN                          equ 0006h
PMD2_DACMD_POSITION                      equ 0006h
PMD2_DACMD_SIZE                          equ 0001h
PMD2_DACMD_LENGTH                        equ 0001h
PMD2_DACMD_MASK                          equ 0040h
PMD2_RTCCMD_POSN                         equ 0007h
PMD2_RTCCMD_POSITION                     equ 0007h
PMD2_RTCCMD_SIZE                         equ 0001h
PMD2_RTCCMD_LENGTH                       equ 0001h
PMD2_RTCCMD_MASK                         equ 0080h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0799h
// bitfield definitions
PMD3_CCP1MD_POSN                         equ 0000h
PMD3_CCP1MD_POSITION                     equ 0000h
PMD3_CCP1MD_SIZE                         equ 0001h
PMD3_CCP1MD_LENGTH                       equ 0001h
PMD3_CCP1MD_MASK                         equ 0001h
PMD3_CCP2MD_POSN                         equ 0001h
PMD3_CCP2MD_POSITION                     equ 0001h
PMD3_CCP2MD_SIZE                         equ 0001h
PMD3_CCP2MD_LENGTH                       equ 0001h
PMD3_CCP2MD_MASK                         equ 0002h
PMD3_CCP3MD_POSN                         equ 0002h
PMD3_CCP3MD_POSITION                     equ 0002h
PMD3_CCP3MD_SIZE                         equ 0001h
PMD3_CCP3MD_LENGTH                       equ 0001h
PMD3_CCP3MD_MASK                         equ 0004h
PMD3_CCP4MD_POSN                         equ 0003h
PMD3_CCP4MD_POSITION                     equ 0003h
PMD3_CCP4MD_SIZE                         equ 0001h
PMD3_CCP4MD_LENGTH                       equ 0001h
PMD3_CCP4MD_MASK                         equ 0008h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 079Ah
// bitfield definitions
PMD4_CWG1MD_POSN                         equ 0000h
PMD4_CWG1MD_POSITION                     equ 0000h
PMD4_CWG1MD_SIZE                         equ 0001h
PMD4_CWG1MD_LENGTH                       equ 0001h
PMD4_CWG1MD_MASK                         equ 0001h
PMD4_MSSP1MD_POSN                        equ 0004h
PMD4_MSSP1MD_POSITION                    equ 0004h
PMD4_MSSP1MD_SIZE                        equ 0001h
PMD4_MSSP1MD_LENGTH                      equ 0001h
PMD4_MSSP1MD_MASK                        equ 0010h
PMD4_UART1MD_POSN                        equ 0006h
PMD4_UART1MD_POSITION                    equ 0006h
PMD4_UART1MD_SIZE                        equ 0001h
PMD4_UART1MD_LENGTH                      equ 0001h
PMD4_UART1MD_MASK                        equ 0040h
PMD4_UART2MD_POSN                        equ 0007h
PMD4_UART2MD_POSITION                    equ 0007h
PMD4_UART2MD_SIZE                        equ 0001h
PMD4_UART2MD_LENGTH                      equ 0001h
PMD4_UART2MD_MASK                        equ 0080h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 079Bh
// bitfield definitions
PMD5_CLC1MD_POSN                         equ 0001h
PMD5_CLC1MD_POSITION                     equ 0001h
PMD5_CLC1MD_SIZE                         equ 0001h
PMD5_CLC1MD_LENGTH                       equ 0001h
PMD5_CLC1MD_MASK                         equ 0002h
PMD5_CLC2MD_POSN                         equ 0002h
PMD5_CLC2MD_POSITION                     equ 0002h
PMD5_CLC2MD_SIZE                         equ 0001h
PMD5_CLC2MD_LENGTH                       equ 0001h
PMD5_CLC2MD_MASK                         equ 0004h
PMD5_CLC3MD_POSN                         equ 0003h
PMD5_CLC3MD_POSITION                     equ 0003h
PMD5_CLC3MD_SIZE                         equ 0001h
PMD5_CLC3MD_LENGTH                       equ 0001h
PMD5_CLC3MD_MASK                         equ 0008h
PMD5_CLC4MD_POSN                         equ 0004h
PMD5_CLC4MD_POSITION                     equ 0004h
PMD5_CLC4MD_SIZE                         equ 0001h
PMD5_CLC4MD_LENGTH                       equ 0001h
PMD5_CLC4MD_MASK                         equ 0010h
PMD5_LCDMD_POSN                          equ 0005h
PMD5_LCDMD_POSITION                      equ 0005h
PMD5_LCDMD_SIZE                          equ 0001h
PMD5_LCDMD_LENGTH                        equ 0001h
PMD5_LCDMD_MASK                          equ 0020h
PMD5_SMT1MD_POSN                         equ 0006h
PMD5_SMT1MD_POSITION                     equ 0006h
PMD5_SMT1MD_SIZE                         equ 0001h
PMD5_SMT1MD_LENGTH                       equ 0001h
PMD5_SMT1MD_MASK                         equ 0040h

// Register: WDTCON0
#define WDTCON0 WDTCON0
WDTCON0                                  equ 080Ch
// bitfield definitions
WDTCON0_SEN_POSN                         equ 0000h
WDTCON0_SEN_POSITION                     equ 0000h
WDTCON0_SEN_SIZE                         equ 0001h
WDTCON0_SEN_LENGTH                       equ 0001h
WDTCON0_SEN_MASK                         equ 0001h
WDTCON0_WDTPS_POSN                       equ 0001h
WDTCON0_WDTPS_POSITION                   equ 0001h
WDTCON0_WDTPS_SIZE                       equ 0005h
WDTCON0_WDTPS_LENGTH                     equ 0005h
WDTCON0_WDTPS_MASK                       equ 003Eh
WDTCON0_SWDTEN_POSN                      equ 0000h
WDTCON0_SWDTEN_POSITION                  equ 0000h
WDTCON0_SWDTEN_SIZE                      equ 0001h
WDTCON0_SWDTEN_LENGTH                    equ 0001h
WDTCON0_SWDTEN_MASK                      equ 0001h
WDTCON0_WDTSEN_POSN                      equ 0000h
WDTCON0_WDTSEN_POSITION                  equ 0000h
WDTCON0_WDTSEN_SIZE                      equ 0001h
WDTCON0_WDTSEN_LENGTH                    equ 0001h
WDTCON0_WDTSEN_MASK                      equ 0001h
WDTCON0_WDTPS0_POSN                      equ 0001h
WDTCON0_WDTPS0_POSITION                  equ 0001h
WDTCON0_WDTPS0_SIZE                      equ 0001h
WDTCON0_WDTPS0_LENGTH                    equ 0001h
WDTCON0_WDTPS0_MASK                      equ 0002h
WDTCON0_WDTPS1_POSN                      equ 0002h
WDTCON0_WDTPS1_POSITION                  equ 0002h
WDTCON0_WDTPS1_SIZE                      equ 0001h
WDTCON0_WDTPS1_LENGTH                    equ 0001h
WDTCON0_WDTPS1_MASK                      equ 0004h
WDTCON0_WDTPS2_POSN                      equ 0003h
WDTCON0_WDTPS2_POSITION                  equ 0003h
WDTCON0_WDTPS2_SIZE                      equ 0001h
WDTCON0_WDTPS2_LENGTH                    equ 0001h
WDTCON0_WDTPS2_MASK                      equ 0008h
WDTCON0_WDTPS3_POSN                      equ 0004h
WDTCON0_WDTPS3_POSITION                  equ 0004h
WDTCON0_WDTPS3_SIZE                      equ 0001h
WDTCON0_WDTPS3_LENGTH                    equ 0001h
WDTCON0_WDTPS3_MASK                      equ 0010h
WDTCON0_WDTPS4_POSN                      equ 0005h
WDTCON0_WDTPS4_POSITION                  equ 0005h
WDTCON0_WDTPS4_SIZE                      equ 0001h
WDTCON0_WDTPS4_LENGTH                    equ 0001h
WDTCON0_WDTPS4_MASK                      equ 0020h

// Register: WDTCON1
#define WDTCON1 WDTCON1
WDTCON1                                  equ 080Dh
// bitfield definitions
WDTCON1_WINDOW_POSN                      equ 0000h
WDTCON1_WINDOW_POSITION                  equ 0000h
WDTCON1_WINDOW_SIZE                      equ 0003h
WDTCON1_WINDOW_LENGTH                    equ 0003h
WDTCON1_WINDOW_MASK                      equ 0007h
WDTCON1_WDTCS_POSN                       equ 0004h
WDTCON1_WDTCS_POSITION                   equ 0004h
WDTCON1_WDTCS_SIZE                       equ 0003h
WDTCON1_WDTCS_LENGTH                     equ 0003h
WDTCON1_WDTCS_MASK                       equ 0070h
WDTCON1_WINDOW0_POSN                     equ 0000h
WDTCON1_WINDOW0_POSITION                 equ 0000h
WDTCON1_WINDOW0_SIZE                     equ 0001h
WDTCON1_WINDOW0_LENGTH                   equ 0001h
WDTCON1_WINDOW0_MASK                     equ 0001h
WDTCON1_WINDOW1_POSN                     equ 0001h
WDTCON1_WINDOW1_POSITION                 equ 0001h
WDTCON1_WINDOW1_SIZE                     equ 0001h
WDTCON1_WINDOW1_LENGTH                   equ 0001h
WDTCON1_WINDOW1_MASK                     equ 0002h
WDTCON1_WINDOW2_POSN                     equ 0002h
WDTCON1_WINDOW2_POSITION                 equ 0002h
WDTCON1_WINDOW2_SIZE                     equ 0001h
WDTCON1_WINDOW2_LENGTH                   equ 0001h
WDTCON1_WINDOW2_MASK                     equ 0004h
WDTCON1_WDTWINDOW_POSN                   equ 0000h
WDTCON1_WDTWINDOW_POSITION               equ 0000h
WDTCON1_WDTWINDOW_SIZE                   equ 0003h
WDTCON1_WDTWINDOW_LENGTH                 equ 0003h
WDTCON1_WDTWINDOW_MASK                   equ 0007h
WDTCON1_WDTWINDOW0_POSN                  equ 0000h
WDTCON1_WDTWINDOW0_POSITION              equ 0000h
WDTCON1_WDTWINDOW0_SIZE                  equ 0001h
WDTCON1_WDTWINDOW0_LENGTH                equ 0001h
WDTCON1_WDTWINDOW0_MASK                  equ 0001h
WDTCON1_WDTWINDOW1_POSN                  equ 0001h
WDTCON1_WDTWINDOW1_POSITION              equ 0001h
WDTCON1_WDTWINDOW1_SIZE                  equ 0001h
WDTCON1_WDTWINDOW1_LENGTH                equ 0001h
WDTCON1_WDTWINDOW1_MASK                  equ 0002h
WDTCON1_WDTWINDOW2_POSN                  equ 0002h
WDTCON1_WDTWINDOW2_POSITION              equ 0002h
WDTCON1_WDTWINDOW2_SIZE                  equ 0001h
WDTCON1_WDTWINDOW2_LENGTH                equ 0001h
WDTCON1_WDTWINDOW2_MASK                  equ 0004h
WDTCON1_WDTCS0_POSN                      equ 0004h
WDTCON1_WDTCS0_POSITION                  equ 0004h
WDTCON1_WDTCS0_SIZE                      equ 0001h
WDTCON1_WDTCS0_LENGTH                    equ 0001h
WDTCON1_WDTCS0_MASK                      equ 0010h
WDTCON1_WDTCS1_POSN                      equ 0005h
WDTCON1_WDTCS1_POSITION                  equ 0005h
WDTCON1_WDTCS1_SIZE                      equ 0001h
WDTCON1_WDTCS1_LENGTH                    equ 0001h
WDTCON1_WDTCS1_MASK                      equ 0020h
WDTCON1_WDTCS2_POSN                      equ 0006h
WDTCON1_WDTCS2_POSITION                  equ 0006h
WDTCON1_WDTCS2_SIZE                      equ 0001h
WDTCON1_WDTCS2_LENGTH                    equ 0001h
WDTCON1_WDTCS2_MASK                      equ 0040h

// Register: WDTPSL
#define WDTPSL WDTPSL
WDTPSL                                   equ 080Eh
// bitfield definitions
WDTPSL_PSCNT_POSN                        equ 0000h
WDTPSL_PSCNT_POSITION                    equ 0000h
WDTPSL_PSCNT_SIZE                        equ 0008h
WDTPSL_PSCNT_LENGTH                      equ 0008h
WDTPSL_PSCNT_MASK                        equ 00FFh
WDTPSL_PSCNT0_POSN                       equ 0000h
WDTPSL_PSCNT0_POSITION                   equ 0000h
WDTPSL_PSCNT0_SIZE                       equ 0001h
WDTPSL_PSCNT0_LENGTH                     equ 0001h
WDTPSL_PSCNT0_MASK                       equ 0001h
WDTPSL_PSCNT1_POSN                       equ 0001h
WDTPSL_PSCNT1_POSITION                   equ 0001h
WDTPSL_PSCNT1_SIZE                       equ 0001h
WDTPSL_PSCNT1_LENGTH                     equ 0001h
WDTPSL_PSCNT1_MASK                       equ 0002h
WDTPSL_PSCNT2_POSN                       equ 0002h
WDTPSL_PSCNT2_POSITION                   equ 0002h
WDTPSL_PSCNT2_SIZE                       equ 0001h
WDTPSL_PSCNT2_LENGTH                     equ 0001h
WDTPSL_PSCNT2_MASK                       equ 0004h
WDTPSL_PSCNT3_POSN                       equ 0003h
WDTPSL_PSCNT3_POSITION                   equ 0003h
WDTPSL_PSCNT3_SIZE                       equ 0001h
WDTPSL_PSCNT3_LENGTH                     equ 0001h
WDTPSL_PSCNT3_MASK                       equ 0008h
WDTPSL_PSCNT4_POSN                       equ 0004h
WDTPSL_PSCNT4_POSITION                   equ 0004h
WDTPSL_PSCNT4_SIZE                       equ 0001h
WDTPSL_PSCNT4_LENGTH                     equ 0001h
WDTPSL_PSCNT4_MASK                       equ 0010h
WDTPSL_PSCNT5_POSN                       equ 0005h
WDTPSL_PSCNT5_POSITION                   equ 0005h
WDTPSL_PSCNT5_SIZE                       equ 0001h
WDTPSL_PSCNT5_LENGTH                     equ 0001h
WDTPSL_PSCNT5_MASK                       equ 0020h
WDTPSL_PSCNT6_POSN                       equ 0006h
WDTPSL_PSCNT6_POSITION                   equ 0006h
WDTPSL_PSCNT6_SIZE                       equ 0001h
WDTPSL_PSCNT6_LENGTH                     equ 0001h
WDTPSL_PSCNT6_MASK                       equ 0040h
WDTPSL_PSCNT7_POSN                       equ 0007h
WDTPSL_PSCNT7_POSITION                   equ 0007h
WDTPSL_PSCNT7_SIZE                       equ 0001h
WDTPSL_PSCNT7_LENGTH                     equ 0001h
WDTPSL_PSCNT7_MASK                       equ 0080h
WDTPSL_WDTPSCNT_POSN                     equ 0000h
WDTPSL_WDTPSCNT_POSITION                 equ 0000h
WDTPSL_WDTPSCNT_SIZE                     equ 0008h
WDTPSL_WDTPSCNT_LENGTH                   equ 0008h
WDTPSL_WDTPSCNT_MASK                     equ 00FFh
WDTPSL_WDTPSCNT0_POSN                    equ 0000h
WDTPSL_WDTPSCNT0_POSITION                equ 0000h
WDTPSL_WDTPSCNT0_SIZE                    equ 0001h
WDTPSL_WDTPSCNT0_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT0_MASK                    equ 0001h
WDTPSL_WDTPSCNT1_POSN                    equ 0001h
WDTPSL_WDTPSCNT1_POSITION                equ 0001h
WDTPSL_WDTPSCNT1_SIZE                    equ 0001h
WDTPSL_WDTPSCNT1_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT1_MASK                    equ 0002h
WDTPSL_WDTPSCNT2_POSN                    equ 0002h
WDTPSL_WDTPSCNT2_POSITION                equ 0002h
WDTPSL_WDTPSCNT2_SIZE                    equ 0001h
WDTPSL_WDTPSCNT2_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT2_MASK                    equ 0004h
WDTPSL_WDTPSCNT3_POSN                    equ 0003h
WDTPSL_WDTPSCNT3_POSITION                equ 0003h
WDTPSL_WDTPSCNT3_SIZE                    equ 0001h
WDTPSL_WDTPSCNT3_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT3_MASK                    equ 0008h
WDTPSL_WDTPSCNT4_POSN                    equ 0004h
WDTPSL_WDTPSCNT4_POSITION                equ 0004h
WDTPSL_WDTPSCNT4_SIZE                    equ 0001h
WDTPSL_WDTPSCNT4_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT4_MASK                    equ 0010h
WDTPSL_WDTPSCNT5_POSN                    equ 0005h
WDTPSL_WDTPSCNT5_POSITION                equ 0005h
WDTPSL_WDTPSCNT5_SIZE                    equ 0001h
WDTPSL_WDTPSCNT5_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT5_MASK                    equ 0020h
WDTPSL_WDTPSCNT6_POSN                    equ 0006h
WDTPSL_WDTPSCNT6_POSITION                equ 0006h
WDTPSL_WDTPSCNT6_SIZE                    equ 0001h
WDTPSL_WDTPSCNT6_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT6_MASK                    equ 0040h
WDTPSL_WDTPSCNT7_POSN                    equ 0007h
WDTPSL_WDTPSCNT7_POSITION                equ 0007h
WDTPSL_WDTPSCNT7_SIZE                    equ 0001h
WDTPSL_WDTPSCNT7_LENGTH                  equ 0001h
WDTPSL_WDTPSCNT7_MASK                    equ 0080h

// Register: WDTPSH
#define WDTPSH WDTPSH
WDTPSH                                   equ 080Fh
// bitfield definitions
WDTPSH_PSCNT_POSN                        equ 0000h
WDTPSH_PSCNT_POSITION                    equ 0000h
WDTPSH_PSCNT_SIZE                        equ 0008h
WDTPSH_PSCNT_LENGTH                      equ 0008h
WDTPSH_PSCNT_MASK                        equ 00FFh
WDTPSH_PSCNT8_POSN                       equ 0000h
WDTPSH_PSCNT8_POSITION                   equ 0000h
WDTPSH_PSCNT8_SIZE                       equ 0001h
WDTPSH_PSCNT8_LENGTH                     equ 0001h
WDTPSH_PSCNT8_MASK                       equ 0001h
WDTPSH_PSCNT9_POSN                       equ 0001h
WDTPSH_PSCNT9_POSITION                   equ 0001h
WDTPSH_PSCNT9_SIZE                       equ 0001h
WDTPSH_PSCNT9_LENGTH                     equ 0001h
WDTPSH_PSCNT9_MASK                       equ 0002h
WDTPSH_PSCNT10_POSN                      equ 0002h
WDTPSH_PSCNT10_POSITION                  equ 0002h
WDTPSH_PSCNT10_SIZE                      equ 0001h
WDTPSH_PSCNT10_LENGTH                    equ 0001h
WDTPSH_PSCNT10_MASK                      equ 0004h
WDTPSH_PSCNT11_POSN                      equ 0003h
WDTPSH_PSCNT11_POSITION                  equ 0003h
WDTPSH_PSCNT11_SIZE                      equ 0001h
WDTPSH_PSCNT11_LENGTH                    equ 0001h
WDTPSH_PSCNT11_MASK                      equ 0008h
WDTPSH_PSCNT12_POSN                      equ 0004h
WDTPSH_PSCNT12_POSITION                  equ 0004h
WDTPSH_PSCNT12_SIZE                      equ 0001h
WDTPSH_PSCNT12_LENGTH                    equ 0001h
WDTPSH_PSCNT12_MASK                      equ 0010h
WDTPSH_PSCNT13_POSN                      equ 0005h
WDTPSH_PSCNT13_POSITION                  equ 0005h
WDTPSH_PSCNT13_SIZE                      equ 0001h
WDTPSH_PSCNT13_LENGTH                    equ 0001h
WDTPSH_PSCNT13_MASK                      equ 0020h
WDTPSH_PSCNT14_POSN                      equ 0006h
WDTPSH_PSCNT14_POSITION                  equ 0006h
WDTPSH_PSCNT14_SIZE                      equ 0001h
WDTPSH_PSCNT14_LENGTH                    equ 0001h
WDTPSH_PSCNT14_MASK                      equ 0040h
WDTPSH_PSCNT15_POSN                      equ 0007h
WDTPSH_PSCNT15_POSITION                  equ 0007h
WDTPSH_PSCNT15_SIZE                      equ 0001h
WDTPSH_PSCNT15_LENGTH                    equ 0001h
WDTPSH_PSCNT15_MASK                      equ 0080h
WDTPSH_WDTPSCNT_POSN                     equ 0000h
WDTPSH_WDTPSCNT_POSITION                 equ 0000h
WDTPSH_WDTPSCNT_SIZE                     equ 0008h
WDTPSH_WDTPSCNT_LENGTH                   equ 0008h
WDTPSH_WDTPSCNT_MASK                     equ 00FFh
WDTPSH_WDTPSCNT8_POSN                    equ 0000h
WDTPSH_WDTPSCNT8_POSITION                equ 0000h
WDTPSH_WDTPSCNT8_SIZE                    equ 0001h
WDTPSH_WDTPSCNT8_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT8_MASK                    equ 0001h
WDTPSH_WDTPSCNT9_POSN                    equ 0001h
WDTPSH_WDTPSCNT9_POSITION                equ 0001h
WDTPSH_WDTPSCNT9_SIZE                    equ 0001h
WDTPSH_WDTPSCNT9_LENGTH                  equ 0001h
WDTPSH_WDTPSCNT9_MASK                    equ 0002h
WDTPSH_WDTPSCNT10_POSN                   equ 0002h
WDTPSH_WDTPSCNT10_POSITION               equ 0002h
WDTPSH_WDTPSCNT10_SIZE                   equ 0001h
WDTPSH_WDTPSCNT10_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT10_MASK                   equ 0004h
WDTPSH_WDTPSCNT11_POSN                   equ 0003h
WDTPSH_WDTPSCNT11_POSITION               equ 0003h
WDTPSH_WDTPSCNT11_SIZE                   equ 0001h
WDTPSH_WDTPSCNT11_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT11_MASK                   equ 0008h
WDTPSH_WDTPSCNT12_POSN                   equ 0004h
WDTPSH_WDTPSCNT12_POSITION               equ 0004h
WDTPSH_WDTPSCNT12_SIZE                   equ 0001h
WDTPSH_WDTPSCNT12_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT12_MASK                   equ 0010h
WDTPSH_WDTPSCNT13_POSN                   equ 0005h
WDTPSH_WDTPSCNT13_POSITION               equ 0005h
WDTPSH_WDTPSCNT13_SIZE                   equ 0001h
WDTPSH_WDTPSCNT13_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT13_MASK                   equ 0020h
WDTPSH_WDTPSCNT14_POSN                   equ 0006h
WDTPSH_WDTPSCNT14_POSITION               equ 0006h
WDTPSH_WDTPSCNT14_SIZE                   equ 0001h
WDTPSH_WDTPSCNT14_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT14_MASK                   equ 0040h
WDTPSH_WDTPSCNT15_POSN                   equ 0007h
WDTPSH_WDTPSCNT15_POSITION               equ 0007h
WDTPSH_WDTPSCNT15_SIZE                   equ 0001h
WDTPSH_WDTPSCNT15_LENGTH                 equ 0001h
WDTPSH_WDTPSCNT15_MASK                   equ 0080h

// Register: WDTTMR
#define WDTTMR WDTTMR
WDTTMR                                   equ 0810h
// bitfield definitions
WDTTMR_PSCNT16_POSN                      equ 0000h
WDTTMR_PSCNT16_POSITION                  equ 0000h
WDTTMR_PSCNT16_SIZE                      equ 0001h
WDTTMR_PSCNT16_LENGTH                    equ 0001h
WDTTMR_PSCNT16_MASK                      equ 0001h
WDTTMR_PSCNT17_POSN                      equ 0001h
WDTTMR_PSCNT17_POSITION                  equ 0001h
WDTTMR_PSCNT17_SIZE                      equ 0001h
WDTTMR_PSCNT17_LENGTH                    equ 0001h
WDTTMR_PSCNT17_MASK                      equ 0002h
WDTTMR_STATE_POSN                        equ 0002h
WDTTMR_STATE_POSITION                    equ 0002h
WDTTMR_STATE_SIZE                        equ 0001h
WDTTMR_STATE_LENGTH                      equ 0001h
WDTTMR_STATE_MASK                        equ 0004h
WDTTMR_WDTTMR_POSN                       equ 0003h
WDTTMR_WDTTMR_POSITION                   equ 0003h
WDTTMR_WDTTMR_SIZE                       equ 0005h
WDTTMR_WDTTMR_LENGTH                     equ 0005h
WDTTMR_WDTTMR_MASK                       equ 00F8h
WDTTMR_WDTPSCNT16_POSN                   equ 0000h
WDTTMR_WDTPSCNT16_POSITION               equ 0000h
WDTTMR_WDTPSCNT16_SIZE                   equ 0001h
WDTTMR_WDTPSCNT16_LENGTH                 equ 0001h
WDTTMR_WDTPSCNT16_MASK                   equ 0001h
WDTTMR_WDTPSCNT17_POSN                   equ 0001h
WDTTMR_WDTPSCNT17_POSITION               equ 0001h
WDTTMR_WDTPSCNT17_SIZE                   equ 0001h
WDTTMR_WDTPSCNT17_LENGTH                 equ 0001h
WDTTMR_WDTPSCNT17_MASK                   equ 0002h
WDTTMR_WDTSTATE_POSN                     equ 0002h
WDTTMR_WDTSTATE_POSITION                 equ 0002h
WDTTMR_WDTSTATE_SIZE                     equ 0001h
WDTTMR_WDTSTATE_LENGTH                   equ 0001h
WDTTMR_WDTSTATE_MASK                     equ 0004h
WDTTMR_WDTTMR0_POSN                      equ 0003h
WDTTMR_WDTTMR0_POSITION                  equ 0003h
WDTTMR_WDTTMR0_SIZE                      equ 0001h
WDTTMR_WDTTMR0_LENGTH                    equ 0001h
WDTTMR_WDTTMR0_MASK                      equ 0008h
WDTTMR_WDTTMR1_POSN                      equ 0004h
WDTTMR_WDTTMR1_POSITION                  equ 0004h
WDTTMR_WDTTMR1_SIZE                      equ 0001h
WDTTMR_WDTTMR1_LENGTH                    equ 0001h
WDTTMR_WDTTMR1_MASK                      equ 0010h
WDTTMR_WDTTMR2_POSN                      equ 0005h
WDTTMR_WDTTMR2_POSITION                  equ 0005h
WDTTMR_WDTTMR2_SIZE                      equ 0001h
WDTTMR_WDTTMR2_LENGTH                    equ 0001h
WDTTMR_WDTTMR2_MASK                      equ 0020h
WDTTMR_WDTTMR3_POSN                      equ 0006h
WDTTMR_WDTTMR3_POSITION                  equ 0006h
WDTTMR_WDTTMR3_SIZE                      equ 0001h
WDTTMR_WDTTMR3_LENGTH                    equ 0001h
WDTTMR_WDTTMR3_MASK                      equ 0040h

