GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.inc
// Register: LCDDATA41
#define LCDDATA41 LCDDATA41
LCDDATA41                                equ 01D41h
// bitfield definitions
LCDDATA41_S40C6_POSN                     equ 0000h
LCDDATA41_S40C6_POSITION                 equ 0000h
LCDDATA41_S40C6_SIZE                     equ 0001h
LCDDATA41_S40C6_LENGTH                   equ 0001h
LCDDATA41_S40C6_MASK                     equ 0001h
LCDDATA41_S41C6_POSN                     equ 0001h
LCDDATA41_S41C6_POSITION                 equ 0001h
LCDDATA41_S41C6_SIZE                     equ 0001h
LCDDATA41_S41C6_LENGTH                   equ 0001h
LCDDATA41_S41C6_MASK                     equ 0002h
LCDDATA41_S42C6_POSN                     equ 0002h
LCDDATA41_S42C6_POSITION                 equ 0002h
LCDDATA41_S42C6_SIZE                     equ 0001h
LCDDATA41_S42C6_LENGTH                   equ 0001h
LCDDATA41_S42C6_MASK                     equ 0004h
LCDDATA41_S43C6_POSN                     equ 0003h
LCDDATA41_S43C6_POSITION                 equ 0003h
LCDDATA41_S43C6_SIZE                     equ 0001h
LCDDATA41_S43C6_LENGTH                   equ 0001h
LCDDATA41_S43C6_MASK                     equ 0008h
LCDDATA41_S44C6_POSN                     equ 0004h
LCDDATA41_S44C6_POSITION                 equ 0004h
LCDDATA41_S44C6_SIZE                     equ 0001h
LCDDATA41_S44C6_LENGTH                   equ 0001h
LCDDATA41_S44C6_MASK                     equ 0010h
LCDDATA41_S45C6_POSN                     equ 0005h
LCDDATA41_S45C6_POSITION                 equ 0005h
LCDDATA41_S45C6_SIZE                     equ 0001h
LCDDATA41_S45C6_LENGTH                   equ 0001h
LCDDATA41_S45C6_MASK                     equ 0020h

// Register: LCDDATA42
#define LCDDATA42 LCDDATA42
LCDDATA42                                equ 01D42h
// bitfield definitions
LCDDATA42_S00C7_POSN                     equ 0000h
LCDDATA42_S00C7_POSITION                 equ 0000h
LCDDATA42_S00C7_SIZE                     equ 0001h
LCDDATA42_S00C7_LENGTH                   equ 0001h
LCDDATA42_S00C7_MASK                     equ 0001h
LCDDATA42_S01C7_POSN                     equ 0001h
LCDDATA42_S01C7_POSITION                 equ 0001h
LCDDATA42_S01C7_SIZE                     equ 0001h
LCDDATA42_S01C7_LENGTH                   equ 0001h
LCDDATA42_S01C7_MASK                     equ 0002h
LCDDATA42_S02C7_POSN                     equ 0002h
LCDDATA42_S02C7_POSITION                 equ 0002h
LCDDATA42_S02C7_SIZE                     equ 0001h
LCDDATA42_S02C7_LENGTH                   equ 0001h
LCDDATA42_S02C7_MASK                     equ 0004h
LCDDATA42_S03C7_POSN                     equ 0003h
LCDDATA42_S03C7_POSITION                 equ 0003h
LCDDATA42_S03C7_SIZE                     equ 0001h
LCDDATA42_S03C7_LENGTH                   equ 0001h
LCDDATA42_S03C7_MASK                     equ 0008h
LCDDATA42_S04C7_POSN                     equ 0004h
LCDDATA42_S04C7_POSITION                 equ 0004h
LCDDATA42_S04C7_SIZE                     equ 0001h
LCDDATA42_S04C7_LENGTH                   equ 0001h
LCDDATA42_S04C7_MASK                     equ 0010h
LCDDATA42_S05C7_POSN                     equ 0005h
LCDDATA42_S05C7_POSITION                 equ 0005h
LCDDATA42_S05C7_SIZE                     equ 0001h
LCDDATA42_S05C7_LENGTH                   equ 0001h
LCDDATA42_S05C7_MASK                     equ 0020h
LCDDATA42_S06C7_POSN                     equ 0006h
LCDDATA42_S06C7_POSITION                 equ 0006h
LCDDATA42_S06C7_SIZE                     equ 0001h
LCDDATA42_S06C7_LENGTH                   equ 0001h
LCDDATA42_S06C7_MASK                     equ 0040h
LCDDATA42_S07C7_POSN                     equ 0007h
LCDDATA42_S07C7_POSITION                 equ 0007h
LCDDATA42_S07C7_SIZE                     equ 0001h
LCDDATA42_S07C7_LENGTH                   equ 0001h
LCDDATA42_S07C7_MASK                     equ 0080h

// Register: LCDDATA43
#define LCDDATA43 LCDDATA43
LCDDATA43                                equ 01D43h
// bitfield definitions
LCDDATA43_S08C7_POSN                     equ 0000h
LCDDATA43_S08C7_POSITION                 equ 0000h
LCDDATA43_S08C7_SIZE                     equ 0001h
LCDDATA43_S08C7_LENGTH                   equ 0001h
LCDDATA43_S08C7_MASK                     equ 0001h
LCDDATA43_S09C7_POSN                     equ 0001h
LCDDATA43_S09C7_POSITION                 equ 0001h
LCDDATA43_S09C7_SIZE                     equ 0001h
LCDDATA43_S09C7_LENGTH                   equ 0001h
LCDDATA43_S09C7_MASK                     equ 0002h
LCDDATA43_S10C7_POSN                     equ 0002h
LCDDATA43_S10C7_POSITION                 equ 0002h
LCDDATA43_S10C7_SIZE                     equ 0001h
LCDDATA43_S10C7_LENGTH                   equ 0001h
LCDDATA43_S10C7_MASK                     equ 0004h
LCDDATA43_S11C7_POSN                     equ 0003h
LCDDATA43_S11C7_POSITION                 equ 0003h
LCDDATA43_S11C7_SIZE                     equ 0001h
LCDDATA43_S11C7_LENGTH                   equ 0001h
LCDDATA43_S11C7_MASK                     equ 0008h
LCDDATA43_S12C7_POSN                     equ 0004h
LCDDATA43_S12C7_POSITION                 equ 0004h
LCDDATA43_S12C7_SIZE                     equ 0001h
LCDDATA43_S12C7_LENGTH                   equ 0001h
LCDDATA43_S12C7_MASK                     equ 0010h
LCDDATA43_S13C7_POSN                     equ 0005h
LCDDATA43_S13C7_POSITION                 equ 0005h
LCDDATA43_S13C7_SIZE                     equ 0001h
LCDDATA43_S13C7_LENGTH                   equ 0001h
LCDDATA43_S13C7_MASK                     equ 0020h
LCDDATA43_S14C7_POSN                     equ 0006h
LCDDATA43_S14C7_POSITION                 equ 0006h
LCDDATA43_S14C7_SIZE                     equ 0001h
LCDDATA43_S14C7_LENGTH                   equ 0001h
LCDDATA43_S14C7_MASK                     equ 0040h
LCDDATA43_S15C7_POSN                     equ 0007h
LCDDATA43_S15C7_POSITION                 equ 0007h
LCDDATA43_S15C7_SIZE                     equ 0001h
LCDDATA43_S15C7_LENGTH                   equ 0001h
LCDDATA43_S15C7_MASK                     equ 0080h

// Register: LCDDATA44
#define LCDDATA44 LCDDATA44
LCDDATA44                                equ 01D44h
// bitfield definitions
LCDDATA44_S16C7_POSN                     equ 0000h
LCDDATA44_S16C7_POSITION                 equ 0000h
LCDDATA44_S16C7_SIZE                     equ 0001h
LCDDATA44_S16C7_LENGTH                   equ 0001h
LCDDATA44_S16C7_MASK                     equ 0001h
LCDDATA44_S17C7_POSN                     equ 0001h
LCDDATA44_S17C7_POSITION                 equ 0001h
LCDDATA44_S17C7_SIZE                     equ 0001h
LCDDATA44_S17C7_LENGTH                   equ 0001h
LCDDATA44_S17C7_MASK                     equ 0002h
LCDDATA44_S18C7_POSN                     equ 0002h
LCDDATA44_S18C7_POSITION                 equ 0002h
LCDDATA44_S18C7_SIZE                     equ 0001h
LCDDATA44_S18C7_LENGTH                   equ 0001h
LCDDATA44_S18C7_MASK                     equ 0004h
LCDDATA44_S19C7_POSN                     equ 0003h
LCDDATA44_S19C7_POSITION                 equ 0003h
LCDDATA44_S19C7_SIZE                     equ 0001h
LCDDATA44_S19C7_LENGTH                   equ 0001h
LCDDATA44_S19C7_MASK                     equ 0008h
LCDDATA44_S20C7_POSN                     equ 0004h
LCDDATA44_S20C7_POSITION                 equ 0004h
LCDDATA44_S20C7_SIZE                     equ 0001h
LCDDATA44_S20C7_LENGTH                   equ 0001h
LCDDATA44_S20C7_MASK                     equ 0010h
LCDDATA44_S21C7_POSN                     equ 0005h
LCDDATA44_S21C7_POSITION                 equ 0005h
LCDDATA44_S21C7_SIZE                     equ 0001h
LCDDATA44_S21C7_LENGTH                   equ 0001h
LCDDATA44_S21C7_MASK                     equ 0020h
LCDDATA44_S22C7_POSN                     equ 0006h
LCDDATA44_S22C7_POSITION                 equ 0006h
LCDDATA44_S22C7_SIZE                     equ 0001h
LCDDATA44_S22C7_LENGTH                   equ 0001h
LCDDATA44_S22C7_MASK                     equ 0040h
LCDDATA44_S23C7_POSN                     equ 0007h
LCDDATA44_S23C7_POSITION                 equ 0007h
LCDDATA44_S23C7_SIZE                     equ 0001h
LCDDATA44_S23C7_LENGTH                   equ 0001h
LCDDATA44_S23C7_MASK                     equ 0080h

// Register: LCDDATA45
#define LCDDATA45 LCDDATA45
LCDDATA45                                equ 01D45h
// bitfield definitions
LCDDATA45_S24C7_POSN                     equ 0000h
LCDDATA45_S24C7_POSITION                 equ 0000h
LCDDATA45_S24C7_SIZE                     equ 0001h
LCDDATA45_S24C7_LENGTH                   equ 0001h
LCDDATA45_S24C7_MASK                     equ 0001h
LCDDATA45_S25C7_POSN                     equ 0001h
LCDDATA45_S25C7_POSITION                 equ 0001h
LCDDATA45_S25C7_SIZE                     equ 0001h
LCDDATA45_S25C7_LENGTH                   equ 0001h
LCDDATA45_S25C7_MASK                     equ 0002h
LCDDATA45_S26C7_POSN                     equ 0002h
LCDDATA45_S26C7_POSITION                 equ 0002h
LCDDATA45_S26C7_SIZE                     equ 0001h
LCDDATA45_S26C7_LENGTH                   equ 0001h
LCDDATA45_S26C7_MASK                     equ 0004h
LCDDATA45_S27C7_POSN                     equ 0003h
LCDDATA45_S27C7_POSITION                 equ 0003h
LCDDATA45_S27C7_SIZE                     equ 0001h
LCDDATA45_S27C7_LENGTH                   equ 0001h
LCDDATA45_S27C7_MASK                     equ 0008h
LCDDATA45_S28C7_POSN                     equ 0004h
LCDDATA45_S28C7_POSITION                 equ 0004h
LCDDATA45_S28C7_SIZE                     equ 0001h
LCDDATA45_S28C7_LENGTH                   equ 0001h
LCDDATA45_S28C7_MASK                     equ 0010h
LCDDATA45_S29C7_POSN                     equ 0005h
LCDDATA45_S29C7_POSITION                 equ 0005h
LCDDATA45_S29C7_SIZE                     equ 0001h
LCDDATA45_S29C7_LENGTH                   equ 0001h
LCDDATA45_S29C7_MASK                     equ 0020h
LCDDATA45_S30C7_POSN                     equ 0006h
LCDDATA45_S30C7_POSITION                 equ 0006h
LCDDATA45_S30C7_SIZE                     equ 0001h
LCDDATA45_S30C7_LENGTH                   equ 0001h
LCDDATA45_S30C7_MASK                     equ 0040h
LCDDATA45_S31C7_POSN                     equ 0007h
LCDDATA45_S31C7_POSITION                 equ 0007h
LCDDATA45_S31C7_SIZE                     equ 0001h
LCDDATA45_S31C7_LENGTH                   equ 0001h
LCDDATA45_S31C7_MASK                     equ 0080h

// Register: LCDDATA46
#define LCDDATA46 LCDDATA46
LCDDATA46                                equ 01D46h
// bitfield definitions
LCDDATA46_S32C7_POSN                     equ 0000h
LCDDATA46_S32C7_POSITION                 equ 0000h
LCDDATA46_S32C7_SIZE                     equ 0001h
LCDDATA46_S32C7_LENGTH                   equ 0001h
LCDDATA46_S32C7_MASK                     equ 0001h
LCDDATA46_S33C7_POSN                     equ 0001h
LCDDATA46_S33C7_POSITION                 equ 0001h
LCDDATA46_S33C7_SIZE                     equ 0001h
LCDDATA46_S33C7_LENGTH                   equ 0001h
LCDDATA46_S33C7_MASK                     equ 0002h
LCDDATA46_S34C7_POSN                     equ 0002h
LCDDATA46_S34C7_POSITION                 equ 0002h
LCDDATA46_S34C7_SIZE                     equ 0001h
LCDDATA46_S34C7_LENGTH                   equ 0001h
LCDDATA46_S34C7_MASK                     equ 0004h
LCDDATA46_S35C7_POSN                     equ 0003h
LCDDATA46_S35C7_POSITION                 equ 0003h
LCDDATA46_S35C7_SIZE                     equ 0001h
LCDDATA46_S35C7_LENGTH                   equ 0001h
LCDDATA46_S35C7_MASK                     equ 0008h
LCDDATA46_S36C7_POSN                     equ 0004h
LCDDATA46_S36C7_POSITION                 equ 0004h
LCDDATA46_S36C7_SIZE                     equ 0001h
LCDDATA46_S36C7_LENGTH                   equ 0001h
LCDDATA46_S36C7_MASK                     equ 0010h
LCDDATA46_S37C7_POSN                     equ 0005h
LCDDATA46_S37C7_POSITION                 equ 0005h
LCDDATA46_S37C7_SIZE                     equ 0001h
LCDDATA46_S37C7_LENGTH                   equ 0001h
LCDDATA46_S37C7_MASK                     equ 0020h
LCDDATA46_S38C7_POSN                     equ 0006h
LCDDATA46_S38C7_POSITION                 equ 0006h
LCDDATA46_S38C7_SIZE                     equ 0001h
LCDDATA46_S38C7_LENGTH                   equ 0001h
LCDDATA46_S38C7_MASK                     equ 0040h
LCDDATA46_S39C7_POSN                     equ 0007h
LCDDATA46_S39C7_POSITION                 equ 0007h
LCDDATA46_S39C7_SIZE                     equ 0001h
LCDDATA46_S39C7_LENGTH                   equ 0001h
LCDDATA46_S39C7_MASK                     equ 0080h

// Register: LCDDATA47
#define LCDDATA47 LCDDATA47
LCDDATA47                                equ 01D47h
// bitfield definitions
LCDDATA47_S40C7_POSN                     equ 0000h
LCDDATA47_S40C7_POSITION                 equ 0000h
LCDDATA47_S40C7_SIZE                     equ 0001h
LCDDATA47_S40C7_LENGTH                   equ 0001h
LCDDATA47_S40C7_MASK                     equ 0001h
LCDDATA47_S41C7_POSN                     equ 0001h
LCDDATA47_S41C7_POSITION                 equ 0001h
LCDDATA47_S41C7_SIZE                     equ 0001h
LCDDATA47_S41C7_LENGTH                   equ 0001h
LCDDATA47_S41C7_MASK                     equ 0002h
LCDDATA47_S42C7_POSN                     equ 0002h
LCDDATA47_S42C7_POSITION                 equ 0002h
LCDDATA47_S42C7_SIZE                     equ 0001h
LCDDATA47_S42C7_LENGTH                   equ 0001h
LCDDATA47_S42C7_MASK                     equ 0004h
LCDDATA47_S43C7_POSN                     equ 0003h
LCDDATA47_S43C7_POSITION                 equ 0003h
LCDDATA47_S43C7_SIZE                     equ 0001h
LCDDATA47_S43C7_LENGTH                   equ 0001h
LCDDATA47_S43C7_MASK                     equ 0008h
LCDDATA47_S44C7_POSN                     equ 0004h
LCDDATA47_S44C7_POSITION                 equ 0004h
LCDDATA47_S44C7_SIZE                     equ 0001h
LCDDATA47_S44C7_LENGTH                   equ 0001h
LCDDATA47_S44C7_MASK                     equ 0010h
LCDDATA47_S45C7_POSN                     equ 0005h
LCDDATA47_S45C7_POSITION                 equ 0005h
LCDDATA47_S45C7_SIZE                     equ 0001h
LCDDATA47_S45C7_LENGTH                   equ 0001h
LCDDATA47_S45C7_MASK                     equ 0020h

// Register: CLCDATA
#define CLCDATA CLCDATA
CLCDATA                                  equ 01E0Fh
// bitfield definitions
CLCDATA_MLC1OUT_POSN                     equ 0000h
CLCDATA_MLC1OUT_POSITION                 equ 0000h
CLCDATA_MLC1OUT_SIZE                     equ 0001h
CLCDATA_MLC1OUT_LENGTH                   equ 0001h
CLCDATA_MLC1OUT_MASK                     equ 0001h
CLCDATA_MLC2OUT_POSN                     equ 0001h
CLCDATA_MLC2OUT_POSITION                 equ 0001h
CLCDATA_MLC2OUT_SIZE                     equ 0001h
CLCDATA_MLC2OUT_LENGTH                   equ 0001h
CLCDATA_MLC2OUT_MASK                     equ 0002h
CLCDATA_MLC3OUT_POSN                     equ 0002h
CLCDATA_MLC3OUT_POSITION                 equ 0002h
CLCDATA_MLC3OUT_SIZE                     equ 0001h
CLCDATA_MLC3OUT_LENGTH                   equ 0001h
CLCDATA_MLC3OUT_MASK                     equ 0004h
CLCDATA_MLC4OUT_POSN                     equ 0003h
CLCDATA_MLC4OUT_POSITION                 equ 0003h
CLCDATA_MLC4OUT_SIZE                     equ 0001h
CLCDATA_MLC4OUT_LENGTH                   equ 0001h
CLCDATA_MLC4OUT_MASK                     equ 0008h

