GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.inc
// Register: ANSELG
#define ANSELG ANSELG
ANSELG                                   equ 01E5Bh
// bitfield definitions
ANSELG_ANSG0_POSN                        equ 0000h
ANSELG_ANSG0_POSITION                    equ 0000h
ANSELG_ANSG0_SIZE                        equ 0001h
ANSELG_ANSG0_LENGTH                      equ 0001h
ANSELG_ANSG0_MASK                        equ 0001h
ANSELG_ANSG1_POSN                        equ 0001h
ANSELG_ANSG1_POSITION                    equ 0001h
ANSELG_ANSG1_SIZE                        equ 0001h
ANSELG_ANSG1_LENGTH                      equ 0001h
ANSELG_ANSG1_MASK                        equ 0002h
ANSELG_ANSG2_POSN                        equ 0002h
ANSELG_ANSG2_POSITION                    equ 0002h
ANSELG_ANSG2_SIZE                        equ 0001h
ANSELG_ANSG2_LENGTH                      equ 0001h
ANSELG_ANSG2_MASK                        equ 0004h
ANSELG_ANSG3_POSN                        equ 0003h
ANSELG_ANSG3_POSITION                    equ 0003h
ANSELG_ANSG3_SIZE                        equ 0001h
ANSELG_ANSG3_LENGTH                      equ 0001h
ANSELG_ANSG3_MASK                        equ 0008h
ANSELG_ANSG4_POSN                        equ 0004h
ANSELG_ANSG4_POSITION                    equ 0004h
ANSELG_ANSG4_SIZE                        equ 0001h
ANSELG_ANSG4_LENGTH                      equ 0001h
ANSELG_ANSG4_MASK                        equ 0010h
ANSELG_ANSG6_POSN                        equ 0006h
ANSELG_ANSG6_POSITION                    equ 0006h
ANSELG_ANSG6_SIZE                        equ 0001h
ANSELG_ANSG6_LENGTH                      equ 0001h
ANSELG_ANSG6_MASK                        equ 0040h
ANSELG_ANSG7_POSN                        equ 0007h
ANSELG_ANSG7_POSITION                    equ 0007h
ANSELG_ANSG7_SIZE                        equ 0001h
ANSELG_ANSG7_LENGTH                      equ 0001h
ANSELG_ANSG7_MASK                        equ 0080h

// Register: WPUG
#define WPUG WPUG
WPUG                                     equ 01E5Ch
// bitfield definitions
WPUG_WPUG0_POSN                          equ 0000h
WPUG_WPUG0_POSITION                      equ 0000h
WPUG_WPUG0_SIZE                          equ 0001h
WPUG_WPUG0_LENGTH                        equ 0001h
WPUG_WPUG0_MASK                          equ 0001h
WPUG_WPUG1_POSN                          equ 0001h
WPUG_WPUG1_POSITION                      equ 0001h
WPUG_WPUG1_SIZE                          equ 0001h
WPUG_WPUG1_LENGTH                        equ 0001h
WPUG_WPUG1_MASK                          equ 0002h
WPUG_WPUG2_POSN                          equ 0002h
WPUG_WPUG2_POSITION                      equ 0002h
WPUG_WPUG2_SIZE                          equ 0001h
WPUG_WPUG2_LENGTH                        equ 0001h
WPUG_WPUG2_MASK                          equ 0004h
WPUG_WPUG3_POSN                          equ 0003h
WPUG_WPUG3_POSITION                      equ 0003h
WPUG_WPUG3_SIZE                          equ 0001h
WPUG_WPUG3_LENGTH                        equ 0001h
WPUG_WPUG3_MASK                          equ 0008h
WPUG_WPUG4_POSN                          equ 0004h
WPUG_WPUG4_POSITION                      equ 0004h
WPUG_WPUG4_SIZE                          equ 0001h
WPUG_WPUG4_LENGTH                        equ 0001h
WPUG_WPUG4_MASK                          equ 0010h
WPUG_WPUG5_POSN                          equ 0005h
WPUG_WPUG5_POSITION                      equ 0005h
WPUG_WPUG5_SIZE                          equ 0001h
WPUG_WPUG5_LENGTH                        equ 0001h
WPUG_WPUG5_MASK                          equ 0020h
WPUG_WPUG6_POSN                          equ 0006h
WPUG_WPUG6_POSITION                      equ 0006h
WPUG_WPUG6_SIZE                          equ 0001h
WPUG_WPUG6_LENGTH                        equ 0001h
WPUG_WPUG6_MASK                          equ 0040h
WPUG_WPUG7_POSN                          equ 0007h
WPUG_WPUG7_POSITION                      equ 0007h
WPUG_WPUG7_SIZE                          equ 0001h
WPUG_WPUG7_LENGTH                        equ 0001h
WPUG_WPUG7_MASK                          equ 0080h

// Register: ODCONG
#define ODCONG ODCONG
ODCONG                                   equ 01E5Dh
// bitfield definitions
ODCONG_ODCG0_POSN                        equ 0000h
ODCONG_ODCG0_POSITION                    equ 0000h
ODCONG_ODCG0_SIZE                        equ 0001h
ODCONG_ODCG0_LENGTH                      equ 0001h
ODCONG_ODCG0_MASK                        equ 0001h
ODCONG_ODCG1_POSN                        equ 0001h
ODCONG_ODCG1_POSITION                    equ 0001h
ODCONG_ODCG1_SIZE                        equ 0001h
ODCONG_ODCG1_LENGTH                      equ 0001h
ODCONG_ODCG1_MASK                        equ 0002h
ODCONG_ODCG2_POSN                        equ 0002h
ODCONG_ODCG2_POSITION                    equ 0002h
ODCONG_ODCG2_SIZE                        equ 0001h
ODCONG_ODCG2_LENGTH                      equ 0001h
ODCONG_ODCG2_MASK                        equ 0004h
ODCONG_ODCG3_POSN                        equ 0003h
ODCONG_ODCG3_POSITION                    equ 0003h
ODCONG_ODCG3_SIZE                        equ 0001h
ODCONG_ODCG3_LENGTH                      equ 0001h
ODCONG_ODCG3_MASK                        equ 0008h
ODCONG_ODCG4_POSN                        equ 0004h
ODCONG_ODCG4_POSITION                    equ 0004h
ODCONG_ODCG4_SIZE                        equ 0001h
ODCONG_ODCG4_LENGTH                      equ 0001h
ODCONG_ODCG4_MASK                        equ 0010h
ODCONG_ODCG6_POSN                        equ 0006h
ODCONG_ODCG6_POSITION                    equ 0006h
ODCONG_ODCG6_SIZE                        equ 0001h
ODCONG_ODCG6_LENGTH                      equ 0001h
ODCONG_ODCG6_MASK                        equ 0040h
ODCONG_ODCG7_POSN                        equ 0007h
ODCONG_ODCG7_POSITION                    equ 0007h
ODCONG_ODCG7_SIZE                        equ 0001h
ODCONG_ODCG7_LENGTH                      equ 0001h
ODCONG_ODCG7_MASK                        equ 0080h

// Register: SLRCONG
#define SLRCONG SLRCONG
SLRCONG                                  equ 01E5Eh
// bitfield definitions
SLRCONG_SLRG0_POSN                       equ 0000h
SLRCONG_SLRG0_POSITION                   equ 0000h
SLRCONG_SLRG0_SIZE                       equ 0001h
SLRCONG_SLRG0_LENGTH                     equ 0001h
SLRCONG_SLRG0_MASK                       equ 0001h
SLRCONG_SLRG1_POSN                       equ 0001h
SLRCONG_SLRG1_POSITION                   equ 0001h
SLRCONG_SLRG1_SIZE                       equ 0001h
SLRCONG_SLRG1_LENGTH                     equ 0001h
SLRCONG_SLRG1_MASK                       equ 0002h
SLRCONG_SLRG2_POSN                       equ 0002h
SLRCONG_SLRG2_POSITION                   equ 0002h
SLRCONG_SLRG2_SIZE                       equ 0001h
SLRCONG_SLRG2_LENGTH                     equ 0001h
SLRCONG_SLRG2_MASK                       equ 0004h
SLRCONG_SLRG3_POSN                       equ 0003h
SLRCONG_SLRG3_POSITION                   equ 0003h
SLRCONG_SLRG3_SIZE                       equ 0001h
SLRCONG_SLRG3_LENGTH                     equ 0001h
SLRCONG_SLRG3_MASK                       equ 0008h
SLRCONG_SLRG4_POSN                       equ 0004h
SLRCONG_SLRG4_POSITION                   equ 0004h
SLRCONG_SLRG4_SIZE                       equ 0001h
SLRCONG_SLRG4_LENGTH                     equ 0001h
SLRCONG_SLRG4_MASK                       equ 0010h
SLRCONG_SLRG6_POSN                       equ 0006h
SLRCONG_SLRG6_POSITION                   equ 0006h
SLRCONG_SLRG6_SIZE                       equ 0001h
SLRCONG_SLRG6_LENGTH                     equ 0001h
SLRCONG_SLRG6_MASK                       equ 0040h
SLRCONG_SLRG7_POSN                       equ 0007h
SLRCONG_SLRG7_POSITION                   equ 0007h
SLRCONG_SLRG7_SIZE                       equ 0001h
SLRCONG_SLRG7_LENGTH                     equ 0001h
SLRCONG_SLRG7_MASK                       equ 0080h

// Register: INLVLG
#define INLVLG INLVLG
INLVLG                                   equ 01E5Fh
// bitfield definitions
INLVLG_INLVLG0_POSN                      equ 0000h
INLVLG_INLVLG0_POSITION                  equ 0000h
INLVLG_INLVLG0_SIZE                      equ 0001h
INLVLG_INLVLG0_LENGTH                    equ 0001h
INLVLG_INLVLG0_MASK                      equ 0001h
INLVLG_INLVLG1_POSN                      equ 0001h
INLVLG_INLVLG1_POSITION                  equ 0001h
INLVLG_INLVLG1_SIZE                      equ 0001h
INLVLG_INLVLG1_LENGTH                    equ 0001h
INLVLG_INLVLG1_MASK                      equ 0002h
INLVLG_INLVLG2_POSN                      equ 0002h
INLVLG_INLVLG2_POSITION                  equ 0002h
INLVLG_INLVLG2_SIZE                      equ 0001h
INLVLG_INLVLG2_LENGTH                    equ 0001h
INLVLG_INLVLG2_MASK                      equ 0004h
INLVLG_INLVLG3_POSN                      equ 0003h
INLVLG_INLVLG3_POSITION                  equ 0003h
INLVLG_INLVLG3_SIZE                      equ 0001h
INLVLG_INLVLG3_LENGTH                    equ 0001h
INLVLG_INLVLG3_MASK                      equ 0008h
INLVLG_INLVLG4_POSN                      equ 0004h
INLVLG_INLVLG4_POSITION                  equ 0004h
INLVLG_INLVLG4_SIZE                      equ 0001h
INLVLG_INLVLG4_LENGTH                    equ 0001h
INLVLG_INLVLG4_MASK                      equ 0010h
INLVLG_INLVLG5_POSN                      equ 0005h
INLVLG_INLVLG5_POSITION                  equ 0005h
INLVLG_INLVLG5_SIZE                      equ 0001h
INLVLG_INLVLG5_LENGTH                    equ 0001h
INLVLG_INLVLG5_MASK                      equ 0020h
INLVLG_INLVLG6_POSN                      equ 0006h
INLVLG_INLVLG6_POSITION                  equ 0006h
INLVLG_INLVLG6_SIZE                      equ 0001h
INLVLG_INLVLG6_LENGTH                    equ 0001h
INLVLG_INLVLG6_MASK                      equ 0040h
INLVLG_INLVLG7_POSN                      equ 0007h
INLVLG_INLVLG7_POSITION                  equ 0007h
INLVLG_INLVLG7_SIZE                      equ 0001h
INLVLG_INLVLG7_LENGTH                    equ 0001h
INLVLG_INLVLG7_MASK                      equ 0080h

// Register: IOCGP
#define IOCGP IOCGP
IOCGP                                    equ 01E60h
// bitfield definitions
IOCGP_IOCGP5_POSN                        equ 0005h
IOCGP_IOCGP5_POSITION                    equ 0005h
IOCGP_IOCGP5_SIZE                        equ 0001h
IOCGP_IOCGP5_LENGTH                      equ 0001h
IOCGP_IOCGP5_MASK                        equ 0020h

