GopalSaraf/Practicals/PSDL/include/proc/pic16f19195.inc
// Register: RE3PPS
#define RE3PPS RE3PPS
RE3PPS                                   equ 01F33h
// bitfield definitions
RE3PPS_RE3PPS0_POSN                      equ 0000h
RE3PPS_RE3PPS0_POSITION                  equ 0000h
RE3PPS_RE3PPS0_SIZE                      equ 0001h
RE3PPS_RE3PPS0_LENGTH                    equ 0001h
RE3PPS_RE3PPS0_MASK                      equ 0001h
RE3PPS_RE3PPS1_POSN                      equ 0001h
RE3PPS_RE3PPS1_POSITION                  equ 0001h
RE3PPS_RE3PPS1_SIZE                      equ 0001h
RE3PPS_RE3PPS1_LENGTH                    equ 0001h
RE3PPS_RE3PPS1_MASK                      equ 0002h
RE3PPS_RE3PPS2_POSN                      equ 0002h
RE3PPS_RE3PPS2_POSITION                  equ 0002h
RE3PPS_RE3PPS2_SIZE                      equ 0001h
RE3PPS_RE3PPS2_LENGTH                    equ 0001h
RE3PPS_RE3PPS2_MASK                      equ 0004h
RE3PPS_RE3PPS3_POSN                      equ 0003h
RE3PPS_RE3PPS3_POSITION                  equ 0003h
RE3PPS_RE3PPS3_SIZE                      equ 0001h
RE3PPS_RE3PPS3_LENGTH                    equ 0001h
RE3PPS_RE3PPS3_MASK                      equ 0008h
RE3PPS_RE3PPS4_POSN                      equ 0004h
RE3PPS_RE3PPS4_POSITION                  equ 0004h
RE3PPS_RE3PPS4_SIZE                      equ 0001h
RE3PPS_RE3PPS4_LENGTH                    equ 0001h
RE3PPS_RE3PPS4_MASK                      equ 0010h
RE3PPS_RE3PPS5_POSN                      equ 0005h
RE3PPS_RE3PPS5_POSITION                  equ 0005h
RE3PPS_RE3PPS5_SIZE                      equ 0001h
RE3PPS_RE3PPS5_LENGTH                    equ 0001h
RE3PPS_RE3PPS5_MASK                      equ 0020h

// Register: RE4PPS
#define RE4PPS RE4PPS
RE4PPS                                   equ 01F34h
// bitfield definitions
RE4PPS_RE4PPS0_POSN                      equ 0000h
RE4PPS_RE4PPS0_POSITION                  equ 0000h
RE4PPS_RE4PPS0_SIZE                      equ 0001h
RE4PPS_RE4PPS0_LENGTH                    equ 0001h
RE4PPS_RE4PPS0_MASK                      equ 0001h
RE4PPS_RE4PPS1_POSN                      equ 0001h
RE4PPS_RE4PPS1_POSITION                  equ 0001h
RE4PPS_RE4PPS1_SIZE                      equ 0001h
RE4PPS_RE4PPS1_LENGTH                    equ 0001h
RE4PPS_RE4PPS1_MASK                      equ 0002h
RE4PPS_RE4PPS2_POSN                      equ 0002h
RE4PPS_RE4PPS2_POSITION                  equ 0002h
RE4PPS_RE4PPS2_SIZE                      equ 0001h
RE4PPS_RE4PPS2_LENGTH                    equ 0001h
RE4PPS_RE4PPS2_MASK                      equ 0004h
RE4PPS_RE4PPS3_POSN                      equ 0003h
RE4PPS_RE4PPS3_POSITION                  equ 0003h
RE4PPS_RE4PPS3_SIZE                      equ 0001h
RE4PPS_RE4PPS3_LENGTH                    equ 0001h
RE4PPS_RE4PPS3_MASK                      equ 0008h
RE4PPS_RE4PPS4_POSN                      equ 0004h
RE4PPS_RE4PPS4_POSITION                  equ 0004h
RE4PPS_RE4PPS4_SIZE                      equ 0001h
RE4PPS_RE4PPS4_LENGTH                    equ 0001h
RE4PPS_RE4PPS4_MASK                      equ 0010h
RE4PPS_RE4PPS5_POSN                      equ 0005h
RE4PPS_RE4PPS5_POSITION                  equ 0005h
RE4PPS_RE4PPS5_SIZE                      equ 0001h
RE4PPS_RE4PPS5_LENGTH                    equ 0001h
RE4PPS_RE4PPS5_MASK                      equ 0020h

// Register: RE5PPS
#define RE5PPS RE5PPS
RE5PPS                                   equ 01F35h
// bitfield definitions
RE5PPS_RE5PPS0_POSN                      equ 0000h
RE5PPS_RE5PPS0_POSITION                  equ 0000h
RE5PPS_RE5PPS0_SIZE                      equ 0001h
RE5PPS_RE5PPS0_LENGTH                    equ 0001h
RE5PPS_RE5PPS0_MASK                      equ 0001h
RE5PPS_RE5PPS1_POSN                      equ 0001h
RE5PPS_RE5PPS1_POSITION                  equ 0001h
RE5PPS_RE5PPS1_SIZE                      equ 0001h
RE5PPS_RE5PPS1_LENGTH                    equ 0001h
RE5PPS_RE5PPS1_MASK                      equ 0002h
RE5PPS_RE5PPS2_POSN                      equ 0002h
RE5PPS_RE5PPS2_POSITION                  equ 0002h
RE5PPS_RE5PPS2_SIZE                      equ 0001h
RE5PPS_RE5PPS2_LENGTH                    equ 0001h
RE5PPS_RE5PPS2_MASK                      equ 0004h
RE5PPS_RE5PPS3_POSN                      equ 0003h
RE5PPS_RE5PPS3_POSITION                  equ 0003h
RE5PPS_RE5PPS3_SIZE                      equ 0001h
RE5PPS_RE5PPS3_LENGTH                    equ 0001h
RE5PPS_RE5PPS3_MASK                      equ 0008h
RE5PPS_RE5PPS4_POSN                      equ 0004h
RE5PPS_RE5PPS4_POSITION                  equ 0004h
RE5PPS_RE5PPS4_SIZE                      equ 0001h
RE5PPS_RE5PPS4_LENGTH                    equ 0001h
RE5PPS_RE5PPS4_MASK                      equ 0010h
RE5PPS_RE5PPS5_POSN                      equ 0005h
RE5PPS_RE5PPS5_POSITION                  equ 0005h
RE5PPS_RE5PPS5_SIZE                      equ 0001h
RE5PPS_RE5PPS5_LENGTH                    equ 0001h
RE5PPS_RE5PPS5_MASK                      equ 0020h

// Register: RE6PPS
#define RE6PPS RE6PPS
RE6PPS                                   equ 01F36h
// bitfield definitions
RE6PPS_RE6PPS0_POSN                      equ 0000h
RE6PPS_RE6PPS0_POSITION                  equ 0000h
RE6PPS_RE6PPS0_SIZE                      equ 0001h
RE6PPS_RE6PPS0_LENGTH                    equ 0001h
RE6PPS_RE6PPS0_MASK                      equ 0001h
RE6PPS_RE6PPS1_POSN                      equ 0001h
RE6PPS_RE6PPS1_POSITION                  equ 0001h
RE6PPS_RE6PPS1_SIZE                      equ 0001h
RE6PPS_RE6PPS1_LENGTH                    equ 0001h
RE6PPS_RE6PPS1_MASK                      equ 0002h
RE6PPS_RE6PPS2_POSN                      equ 0002h
RE6PPS_RE6PPS2_POSITION                  equ 0002h
RE6PPS_RE6PPS2_SIZE                      equ 0001h
RE6PPS_RE6PPS2_LENGTH                    equ 0001h
RE6PPS_RE6PPS2_MASK                      equ 0004h
RE6PPS_RE6PPS3_POSN                      equ 0003h
RE6PPS_RE6PPS3_POSITION                  equ 0003h
RE6PPS_RE6PPS3_SIZE                      equ 0001h
RE6PPS_RE6PPS3_LENGTH                    equ 0001h
RE6PPS_RE6PPS3_MASK                      equ 0008h
RE6PPS_RE6PPS4_POSN                      equ 0004h
RE6PPS_RE6PPS4_POSITION                  equ 0004h
RE6PPS_RE6PPS4_SIZE                      equ 0001h
RE6PPS_RE6PPS4_LENGTH                    equ 0001h
RE6PPS_RE6PPS4_MASK                      equ 0010h
RE6PPS_RE6PPS5_POSN                      equ 0005h
RE6PPS_RE6PPS5_POSITION                  equ 0005h
RE6PPS_RE6PPS5_SIZE                      equ 0001h
RE6PPS_RE6PPS5_LENGTH                    equ 0001h
RE6PPS_RE6PPS5_MASK                      equ 0020h

// Register: RE7PPS
#define RE7PPS RE7PPS
RE7PPS                                   equ 01F37h
// bitfield definitions
RE7PPS_RE7PPS0_POSN                      equ 0000h
RE7PPS_RE7PPS0_POSITION                  equ 0000h
RE7PPS_RE7PPS0_SIZE                      equ 0001h
RE7PPS_RE7PPS0_LENGTH                    equ 0001h
RE7PPS_RE7PPS0_MASK                      equ 0001h
RE7PPS_RE7PPS1_POSN                      equ 0001h
RE7PPS_RE7PPS1_POSITION                  equ 0001h
RE7PPS_RE7PPS1_SIZE                      equ 0001h
RE7PPS_RE7PPS1_LENGTH                    equ 0001h
RE7PPS_RE7PPS1_MASK                      equ 0002h
RE7PPS_RE7PPS2_POSN                      equ 0002h
RE7PPS_RE7PPS2_POSITION                  equ 0002h
RE7PPS_RE7PPS2_SIZE                      equ 0001h
RE7PPS_RE7PPS2_LENGTH                    equ 0001h
RE7PPS_RE7PPS2_MASK                      equ 0004h
RE7PPS_RE7PPS3_POSN                      equ 0003h
RE7PPS_RE7PPS3_POSITION                  equ 0003h
RE7PPS_RE7PPS3_SIZE                      equ 0001h
RE7PPS_RE7PPS3_LENGTH                    equ 0001h
RE7PPS_RE7PPS3_MASK                      equ 0008h
RE7PPS_RE7PPS4_POSN                      equ 0004h
RE7PPS_RE7PPS4_POSITION                  equ 0004h
RE7PPS_RE7PPS4_SIZE                      equ 0001h
RE7PPS_RE7PPS4_LENGTH                    equ 0001h
RE7PPS_RE7PPS4_MASK                      equ 0010h
RE7PPS_RE7PPS5_POSN                      equ 0005h
RE7PPS_RE7PPS5_POSITION                  equ 0005h
RE7PPS_RE7PPS5_SIZE                      equ 0001h
RE7PPS_RE7PPS5_LENGTH                    equ 0001h
RE7PPS_RE7PPS5_MASK                      equ 0020h

// Register: ANSELA
#define ANSELA ANSELA
ANSELA                                   equ 01F38h
// bitfield definitions
ANSELA_ANSA0_POSN                        equ 0000h
ANSELA_ANSA0_POSITION                    equ 0000h
ANSELA_ANSA0_SIZE                        equ 0001h
ANSELA_ANSA0_LENGTH                      equ 0001h
ANSELA_ANSA0_MASK                        equ 0001h
ANSELA_ANSA1_POSN                        equ 0001h
ANSELA_ANSA1_POSITION                    equ 0001h
ANSELA_ANSA1_SIZE                        equ 0001h
ANSELA_ANSA1_LENGTH                      equ 0001h
ANSELA_ANSA1_MASK                        equ 0002h
ANSELA_ANSA2_POSN                        equ 0002h
ANSELA_ANSA2_POSITION                    equ 0002h
ANSELA_ANSA2_SIZE                        equ 0001h
ANSELA_ANSA2_LENGTH                      equ 0001h
ANSELA_ANSA2_MASK                        equ 0004h
ANSELA_ANSA3_POSN                        equ 0003h
ANSELA_ANSA3_POSITION                    equ 0003h
ANSELA_ANSA3_SIZE                        equ 0001h
ANSELA_ANSA3_LENGTH                      equ 0001h
ANSELA_ANSA3_MASK                        equ 0008h
ANSELA_ANSA4_POSN                        equ 0004h
ANSELA_ANSA4_POSITION                    equ 0004h
ANSELA_ANSA4_SIZE                        equ 0001h
ANSELA_ANSA4_LENGTH                      equ 0001h
ANSELA_ANSA4_MASK                        equ 0010h
ANSELA_ANSA6_POSN                        equ 0006h
ANSELA_ANSA6_POSITION                    equ 0006h
ANSELA_ANSA6_SIZE                        equ 0001h
ANSELA_ANSA6_LENGTH                      equ 0001h
ANSELA_ANSA6_MASK                        equ 0040h
ANSELA_ANSA7_POSN                        equ 0007h
ANSELA_ANSA7_POSITION                    equ 0007h
ANSELA_ANSA7_SIZE                        equ 0001h
ANSELA_ANSA7_LENGTH                      equ 0001h
ANSELA_ANSA7_MASK                        equ 0080h

